In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import json
import numpy as np
from datetime import datetime

Exploring the first Dataset

In [4]:
df= pd.read_csv('sales_data.csv')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9800 entries, 0 to 9799
Data columns (total 17 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             9800 non-null   int64
 1   order_id       9800 non-null   object
 2   order_date     9800 non-null   object
 3   ship_date      9800 non-null   object
 4   ship_mode      9800 non-null   object
 5   customer_id    9800 non-null   object
 6   customer_name  9800 non-null   object
 7   country        9800 non-null   object
 8   city           9800 non-null   object
 9   state          9800 non-null   object
 10  postal_code    9789 non-null   float64
 11  region         9800 non-null   object
 12  product_id     9800 non-null   object
 13  category       9800 non-null   object
 14  sub_category   9800 non-null   object
 15  product_name   9800 non-null   object
 16  sales          9800 non-null   float64
dtypes: float64(2), int64(1), object(14)
memory usage: 1.3+ MB

In [6]:
df.describe()

                id   postal_code         sales
count  9800.000000   9789.000000   9800.000000
mean   4900.500000  55273.322403    230.769059
std    2829.160653  32041.223413    626.651875
min       1.000000   1040.000000      0.444000
25%    2450.750000  23223.000000     17.248000
50%    4900.500000  58103.000000     54.490000
75%    7350.250000  90008.000000    210.605000
max    9800.000000  99301.000000  22638.480000

In [7]:
#checking for null values
df.isnull().sum()

id                0
order_id          0
order_date        0
ship_date         0
ship_mode         0
customer_id       0
customer_name     0
country           0
city              0
state             0
postal_code      11
region            0
product_id        0
category          0
sub_category      0
product_name      0
sales             0
dtype: int64

Treating the first dataset

In [8]:
#tracking the null values
null_rows = df.loc[df['postal_code'].isnull(), ['postal_code', 'region','city','state']]
print(null_rows)

      postal_code region        city    state
2234          NaN   East  Burlington  Vermont
5274          NaN   East  Burlington  Vermont
8798          NaN   East  Burlington  Vermont
9146          NaN   East  Burlington  Vermont
9147          NaN   East  Burlington  Vermont
9148          NaN   East  Burlington  Vermont
9386          NaN   East  Burlington  Vermont
9387          NaN   East  Burlington  Vermont
9388          NaN   East  Burlington  Vermont
9389          NaN   East  Burlington  Vermont
9741          NaN   East  Burlington  Vermont

In [9]:
print(df.loc[df['city']=='Burlington',['postal_code','state','city']])

      postal_code           state        city
683       27217.0  North Carolina  Burlington
684       27217.0  North Carolina  Burlington
1008      52601.0            Iowa  Burlington
1038      27217.0  North Carolina  Burlington
1039      27217.0  North Carolina  Burlington
1393      27217.0  North Carolina  Burlington
2234          NaN         Vermont  Burlington
2928      27217.0  North Carolina  Burlington
5065      27217.0  North Carolina  Burlington
5066      27217.0  North Carolina  Burlington
5274          NaN         Vermont  Burlington
8317      27217.0  North Carolina  Burlington
8318      27217.0  North Carolina  Burlington
8410      27217.0  North Carolina  Burlington
8798          NaN         Vermont  Burlington
9146          NaN         Vermont  Burlington
9147          NaN         Vermont  Burlington
9148          NaN         Vermont  Burlington
9209      52601.0            Iowa  Burlington
9210      52601.0            Iowa  Burlington
9386          NaN         Vermont  Burlington
9387          NaN         Vermont  Burlington
9388          NaN         Vermont  Burlington
9389          NaN         Vermont  Burlington
9741          NaN         Vermont  Burlington

In [10]:
#correcting the null values 
df['postal_code'] = df['postal_code'].fillna('05402')
df.isnull().sum()

id               0
order_id         0
order_date       0
ship_date        0
ship_mode        0
customer_id      0
customer_name    0
country          0
city             0
state            0
postal_code      0
region           0
product_id       0
category         0
sub_category     0
product_name     0
sales            0
dtype: int64

In [11]:
#converting dates to the date datatype
df['order_date']= pd.to_datetime(df['order_date'], format='%d/%m/%Y')
df['ship_date']= pd.to_datetime(df['ship_date'], format='%d/%m/%Y')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9800 entries, 0 to 9799
Data columns (total 17 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             9800 non-null   int64
 1   order_id       9800 non-null   object
 2   order_date     9800 non-null   datetime64[ns]
 3   ship_date      9800 non-null   datetime64[ns]
 4   ship_mode      9800 non-null   object
 5   customer_id    9800 non-null   object
 6   customer_name  9800 non-null   object
 7   country        9800 non-null   object
 8   city           9800 non-null   object
 9   state          9800 non-null   object
 10  postal_code    9800 non-null   object
 11  region         9800 non-null   object
 12  product_id     9800 non-null   object
 13  category       9800 non-null   object
 14  sub_category   9800 non-null   object
 15  product_name   9800 non-null   object
 16  sales          9800 non-null   float64
dtypes: datetime64[ns](2), float64(1), int64(1), object(13)
memory usage: 1.3+ MB

Treating the second dataset

In [12]:
with open('customer_ds.json', 'r') as json_file:
    df2 = json.load(json_file)

In [13]:
#exploring the structure
# Check if data is a list
if isinstance(df2, list):
    # Access the first element in the list
    first_element = df2[0]

    # Display keys of the first dictionary in the list
    print("Keys of the first dictionary in the list:", first_element.keys())
else:
    print("The data is not a list of dictionaries.")

Keys of the first dictionary in the list: dict_keys(['customer_id', 'customer_name', 'Education', 'Marital_Status', 'Income', 'Year_Birth'])

In [14]:
print(pd.json_normalize(df2).describe())

              Income   Year_Birth
count     780.000000   793.000000
mean    52100.014103  1968.372005
std     22185.632445    12.604676
min      2447.000000  1893.000000
25%     34756.500000  1959.000000
50%     50977.500000  1970.000000
75%     68634.000000  1977.000000
max    162397.000000  1996.000000

In [15]:
print(pd.json_normalize(df2).isnull().sum())

customer_id        0
customer_name      0
Education          0
Marital_Status     0
Income            13
Year_Birth         0
dtype: int64

In [16]:
# Extract non-null incomes
incomes = [item.get('Income', 0) for item in df2]

# Calculate the mean of non-null incomes
mean_income = np.mean([income for income in incomes if income is not None])

# Replace null incomes with the mean
for item in df2:
    if item.get('Income') is None:
        item['Income'] = mean_income

In [17]:
print(pd.json_normalize(df2).isnull().sum())

customer_id       0
customer_name     0
Education         0
Marital_Status    0
Income            0
Year_Birth        0
dtype: int64

In [18]:
#convertin to the right data types
for item in df2:
    if 'Year_Birth' in item:
        try:
            year_as_int = int(item['Year_Birth'])
            item['Year_Birth'] = datetime(year_as_int, 1, 1)  # Assuming January 1st of the given year
        except ValueError:
            print("Invalid year format for item: {item}")

Building Dimensions

In [19]:
#product dimension

In [20]:
pdm = df.loc[:, ['product_id','product_name','sub_category','category']].copy()
pdm.head()

,product_id,product_name,sub_category,category
0,FUR-BO-10001798,Bush Somerset Collection Bookcase,Bookcases,Furniture
1,FUR-CH-10000454,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",Chairs,Furniture
2,OFF-LA-10000240,Self-Adhesive Address Labels for Typewriters b...,Labels,Office Supplies
3,FUR-TA-10000577,Bretford CR4500 Series Slim Rectangular Table,Tables,Furniture
4,OFF-ST-10000760,Eldon Fold 'N Roll Cart System,Storage,Office Supplies

In [21]:
#eliminating the duplicates and adding the quantities :

# Group by 'id' and count occurrences
pdm['quantity'] = pdm.groupby('product_id')['product_id'].transform('count')

# Drop duplicates from the 'id' column
pdm.drop_duplicates(subset='product_id', inplace=True)

# Reset index after dropping duplicates
pdm.reset_index(drop=True, inplace=True)

pdm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1861 entries, 0 to 1860
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    1861 non-null   object
 1   product_name  1861 non-null   object
 2   sub_category  1861 non-null   object
 3   category      1861 non-null   object
 4   quantity      1861 non-null   int64
dtypes: int64(1), object(4)
memory usage: 72.8+ KB

In [22]:
pdm.head()

,product_id,product_name,sub_category,category,quantity
0,FUR-BO-10001798,Bush Somerset Collection Bookcase,Bookcases,Furniture,4
1,FUR-CH-10000454,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",Chairs,Furniture,12
2,OFF-LA-10000240,Self-Adhesive Address Labels for Typewriters b...,Labels,Office Supplies,7
3,FUR-TA-10000577,Bretford CR4500 Series Slim Rectangular Table,Tables,Furniture,8
4,OFF-ST-10000760,Eldon Fold 'N Roll Cart System,Storage,Office Supplies,5

In [23]:
#building the location dimension

In [24]:
ldm = df.loc[:, ['city','state','region']].copy()
ldm.head()

              city       state region
0        Henderson    Kentucky  South
1        Henderson    Kentucky  South
2      Los Angeles  California   West
3  Fort Lauderdale     Florida  South
4  Fort Lauderdale     Florida  South

In [25]:

ldm['location_id'] = 'L00' + (ldm.groupby(['city', 'state']).ngroup() + 1).astype(str).str.zfill(3)

#Drop duplicates 
ldm.drop_duplicates(subset=['city', 'state'], inplace=True)

# Reset index
ldm.reset_index(drop=True, inplace=True)

ldm.head()

              city           state region location_id
0        Henderson        Kentucky  South      L00226
1      Los Angeles      California   West      L00311
2  Fort Lauderdale         Florida  South      L00182
3          Concord  North Carolina  South      L00114
4          Seattle      Washington   West      L00515

In [26]:
#building time dimension

In [27]:
tdm = df.loc[:, ['order_date']].copy()
tdm.head()

  order_date
0 2017-11-08
1 2017-11-08
2 2017-06-12
3 2016-10-11
4 2016-10-11

In [28]:
#adding the quarter column:
tdm['quarter'] = tdm['order_date'].dt.quarter

In [29]:
#creating the id time 
tdm['time_id'] = 'T00' + tdm['order_date'].dt.strftime('%m%y')

tdm.head()

  order_date  quarter  time_id
0 2017-11-08        4  T001117
1 2017-11-08        4  T001117
2 2017-06-12        2  T000617
3 2016-10-11        4  T001016
4 2016-10-11        4  T001016

In [30]:
# Remove duplicates
tdm = tdm.drop_duplicates(subset=['order_date'])

# Reset index after dropping duplicates
tdm.reset_index(drop=True, inplace=True)

In [31]:
tdm.head()

  order_date  quarter  time_id
0 2017-11-08        4  T001117
1 2017-06-12        2  T000617
2 2016-10-11        4  T001016
3 2015-06-09        2  T000615
4 2018-04-15        2  T000418

In [32]:
#building the order dimension

In [33]:
odm = df.loc[:, ['order_id','order_date','ship_date','ship_mode']].copy()
odm.head()

         order_id order_date  ship_date       ship_mode
0  CA-2017-152156 2017-11-08 2017-11-11    Second Class
1  CA-2017-152156 2017-11-08 2017-11-11    Second Class
2  CA-2017-138688 2017-06-12 2017-06-16    Second Class
3  US-2016-108966 2016-10-11 2016-10-18  Standard Class
4  US-2016-108966 2016-10-11 2016-10-18  Standard Class

In [34]:
#Calculate the period
odm['period'] = (odm['ship_date'] - odm['order_date']).dt.days

In [35]:
# Remove duplicates
odm = odm.drop_duplicates(subset=['order_id'])

# Reset index after dropping duplicates
odm.reset_index(drop=True, inplace=True)

odm.head()

         order_id order_date  ship_date       ship_mode  period
0  CA-2017-152156 2017-11-08 2017-11-11    Second Class       3
1  CA-2017-138688 2017-06-12 2017-06-16    Second Class       4
2  US-2016-108966 2016-10-11 2016-10-18  Standard Class       7
3  CA-2015-115812 2015-06-09 2015-06-14  Standard Class       5
4  CA-2018-114412 2018-04-15 2018-04-20  Standard Class       5

In [36]:
#building the customer dimension

In [37]:
cdm = pd.json_normalize(df2)
cdm.head()

  customer_id    customer_name   Education Marital_Status   Income Year_Birth
0    CG-12520      Claire Gute  Graduation         Single  58138.0 1957-01-01
1    DV-13045  Darrin Van Huff  Graduation         Single  46344.0 1954-01-01
2    SO-20335   Sean O'Donnell  Graduation       Together  71613.0 1965-01-01
3    BH-11710  Brosina Hoffman  Graduation       Together  26646.0 1984-01-01
4    AA-10480     Andrew Allen         PhD        Married  58293.0 1981-01-01

In [38]:
#extracting the dimensions into excel:
pdm.to_excel('product_dim.xlsx',index=False)
ldm.to_excel('location_dim.xlsx',index=False)
tdm.to_excel('time_dim.xlsx',index=False)
cdm.to_excel('customer_dim.xlsx',index=False)
odm.to_excel('order_dim.xlsx',index=False)

Building fact tables

In [39]:
# Condition 1: Assign time_id from tdm if order_date matches
df['time_id'] = df.apply(
    lambda row: tdm.loc[tdm['order_date'] == row['order_date'], 'time_id'].iloc[0] 
                  if row['order_date'] in tdm['order_date'].values else None, 
    axis=1
)

In [40]:
# Condition 2: Assign location_id from ldm if state and city match
df['location_id'] = df.apply(
    lambda row: ldm.loc[(ldm['state'] == row['state']) & (ldm['city'] == row['city']), 'location_id'].iloc[0] 
                  if row['state'] in ldm['state'].values and row['city'] in ldm['city'].values else None, 
    axis=1
)

In [41]:
#Sales Fact

In [42]:
sfc = df[['id','customer_id','time_id','product_id','sales','ship_mode']]
sfc['quantity'] = sfc['product_id'].map(pdm.set_index('product_id')['quantity'])
sfc.head()

C:\Users\Wadie\AppData\Local\Temp\ipykernel_11568\589413572.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sfc['quantity'] = sfc['product_id'].map(pdm.set_index('product_id')['quantity'])

,id,customer_id,time_id,product_id,sales,ship_mode,quantity
0,1,CG-12520,T001117,FUR-BO-10001798,261.9600,Second Class,4
1,2,CG-12520,T001117,FUR-CH-10000454,731.9400,Second Class,12
2,3,DV-13045,T000617,OFF-LA-10000240,14.6200,Second Class,7
3,4,SO-20335,T001016,FUR-TA-10000577,957.5775,Standard Class,8
4,5,SO-20335,T001016,OFF-ST-10000760,22.3680,Standard Class,5

In [43]:
#Order_fact

In [44]:
ofc = df[['id','time_id','location_id','product_id','sales']]

In [45]:
ofc['quantity'] = ofc['product_id'].map(pdm.set_index('product_id')['quantity'])

C:\Users\Wadie\AppData\Local\Temp\ipykernel_11568\4067918377.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ofc['quantity'] = ofc['product_id'].map(pdm.set_index('product_id')['quantity'])

In [46]:
ofc.head()

   id  time_id location_id       product_id     sales  quantity
0   1  T001117      L00226  FUR-BO-10001798  261.9600         4
1   2  T001117      L00226  FUR-CH-10000454  731.9400        12
2   3  T000617      L00311  OFF-LA-10000240   14.6200         7
3   4  T001016      L00182  FUR-TA-10000577  957.5775         8
4   5  T001016      L00182  OFF-ST-10000760   22.3680         5

In [47]:
sfc.to_excel('sales_fact.xlsx',index=False)
ofc.to_excel('order_fact.xlsx',index=False)

Adding the results to mysql

In [57]:
import mysql.connector

In [60]:
conn = mysql.connector.connect(
    host='localhost',
    user='root',
    password='Wdie.66.99',
    database='warehouse2'
)

In [61]:
cursor = conn.cursor()

In [62]:
#creating a function to insert the data
def create_table_from_excel(cursor, excel_file_path, table_name):
    # Load Excel data into a Pandas DataFrame
    df = pd.read_excel(excel_file_path)

    # Create the table
    create_table_query = f"CREATE TABLE {table_name} ({', '.join([f'{col} VARCHAR(255)' for col in df.columns])})"
    cursor.execute(create_table_query)

In [63]:
# Function to check if a table exists
def table_exists_message(cursor, table_name):
    query = f"SELECT table_name FROM information_schema.tables WHERE table_schema = '{warehouse2}' AND table_name = '{table_name}'"
    cursor.execute(query)
    existing_table = cursor.fetchone()

    if existing_table:
        return f"Table '{table_name}' already exists."
    else:
        return f"Table '{table_name}' does not exist."

In [53]:
#inserting the customer dimension
create_table_from_excel(cursor,'customer_dim.xlsx','customer_dim')

ProgrammingError: 1050 (42S01): Table 'customer_dim' already exists

In [ ]:
conn.commit()

In [64]:
def insert_data_from_excel(cursor, excel_file_path, table_name):
    # Load Excel data into a Pandas DataFrame
    df = pd.read_excel(excel_file_path)

    # Create the INSERT query
    columns = ', '.join(df.columns)
    values_placeholder = ', '.join(['%s' for _ in df.columns])
    insert_query = f"INSERT INTO {table_name} ({columns}) VALUES ({values_placeholder})"

    # Iterate through rows and insert data
    for index, row in df.iterrows():
        cursor.execute(insert_query, tuple(row))

In [ ]:
insert_data_from_excel(cursor,'customer_dim.xlsx','customer_dim')

In [ ]:
conn.commit()

In [ ]:
#inserting product dimension

In [ ]:
create_table_from_excel(cursor,'product_dim.xlsx','product_dim')

In [ ]:
insert_data_from_excel(cursor,'product_dim.xlsx','product_dim')
conn.commit()

In [ ]:
#inserting order dimension

In [ ]:
create_table_from_excel(cursor,'order_dim.xlsx','order_dim')

In [ ]:
insert_data_from_excel(cursor,'order_dim.xlsx','order_dim')
conn.commit()

In [ ]:
#inserting location dimension

In [ ]:
create_table_from_excel(cursor,'location_dim.xlsx','location_dim')

In [ ]:
insert_data_from_excel(cursor,'location_dim.xlsx','location_dim')
conn.commit()

In [ ]:
#inserting location dimension

In [ ]:
create_table_from_excel(cursor,'time_dim.xlsx','time_dim')

In [ ]:
insert_data_from_excel(cursor,'time_dim.xlsx','time_dim')
conn.commit()

In [66]:
create_table_from_excel(cursor,'sales_final_final.xlsx','sales_fact')

In [67]:
insert_data_from_excel(cursor,'sales_final_final.xlsx','sales_fact')
conn.commit()

In [69]:
create_table_from_excel(cursor,'inventory_fact.xlsx','inventory_fact')

In [70]:
insert_data_from_excel(cursor,'inventory_fact.xlsx','inventory_fact')
conn.commit()